---
kind: property
id: P:Autodesk.Revit.DB.Macros.Macro.Name
source: html/e33a150b-f223-3f82-a54a-0e2ba86ace5e.htm
---
# Autodesk.Revit.DB.Macros.Macro.Name Property

The macro name.

## Syntax (C#)
```csharp
public string Name { get; }
```